######################################################################
#
# Common Brewfile that declares all packages that should
# be installed for every developer.
# 
# You can add any personal packages by creating a personal Brewfile
# under ~/.config/brew/Brewfile-personal
#
##################################################################

# Brew
tap "homebrew/bundle"
tap "homebrew/services"

# Cloud / Infrastructure 
brew "awscli"
brew "azure-cli"
brew "aws-sso-util"
brew "helm"
brew "k9s"
brew "kubernetes-cli"
brew "tfenv"
brew "tflint"
brew "tfsec"
brew "terraform-docs"
tap "minamijoyo/tfupdate"
brew "minamijoyo/tfupdate/tfupdate"
brew "vault"
brew "docker"
brew "docker-machine", restart_service: true
brew "podman"
cask "podman-desktop"
tap "common-fate/granted"
brew "granted"

# Some dev stuff
brew "asdf"
brew "yarn"
cask "pgadmin4"
brew "pnpm"

# Git
tap "jesseduffield/lazygit"
brew "jesseduffield/lazygit/lazygit"
tap "gabrie30/utils"
brew "gabrie30/utils/ghorg"
brew "pre-commit"
brew "git-lfs"

# Browsers
cask "firefox"
cask "google-chrome"
cask "chromium"

cask "drawio"
cask "synology-drive"

# Shell & utils
cask "iterm2"
cask "kitty"
brew "bat"
brew "tmux"
brew "tree"
brew "diff-so-fancy"
brew "fzf"
brew "fd"
brew "gettext"
brew "jq"
brew "pandoc"
brew "presenterm"
brew "ripgrep"
brew "stow"
brew "typst"
brew "wget"
brew "zsh"
brew "glow"
brew "httpie"
brew "eza"
brew "thefuck"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "git-delta"
cask "rectangle"
brew "starship"
cask "font-fira-code-nerd-font"
cask "wezterm"
cask "wifiman"
brew "ollama"

# Office
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"

# Collaboration
cask "slack"

# IDE
brew "neovim"
cask "visual-studio-code"

